espressif/esp-idf/components/soc/esp32s3/register/soc/world_controller_reg.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** WCL_Core_0_ENTRY_1_ADDR_REG register
 *  Core_0 Entry 1 address configuration Register
 */
#define WCL_CORE_0_ENTRY_1_ADDR_REG (DR_REG_WCL_BASE + 0x0)
/** WCL_CORE_0_ENTRY_1_ADDR : R/W; bitpos: [31:0]; default: 0;
 *  Core_0 Entry 1 address from WORLD1 to WORLD0
 */
#define WCL_CORE_0_ENTRY_1_ADDR    0xFFFFFFFFU
#define WCL_CORE_0_ENTRY_1_ADDR_M  (WCL_CORE_0_ENTRY_1_ADDR_V << WCL_CORE_0_ENTRY_1_ADDR_S)
#define WCL_CORE_0_ENTRY_1_ADDR_V  0xFFFFFFFFU
#define WCL_CORE_0_ENTRY_1_ADDR_S  0

/** WCL_Core_0_ENTRY_2_ADDR_REG register
 *  Core_0 Entry 2 address configuration Register
 */
#define WCL_CORE_0_ENTRY_2_ADDR_REG (DR_REG_WCL_BASE + 0x4)
/** WCL_CORE_0_ENTRY_2_ADDR : R/W; bitpos: [31:0]; default: 0;
 *  Core_0 Entry 2 address from WORLD1 to WORLD0
 */
#define WCL_CORE_0_ENTRY_2_ADDR    0xFFFFFFFFU
#define WCL_CORE_0_ENTRY_2_ADDR_M  (WCL_CORE_0_ENTRY_2_ADDR_V << WCL_CORE_0_ENTRY_2_ADDR_S)
#define WCL_CORE_0_ENTRY_2_ADDR_V  0xFFFFFFFFU
#define WCL_CORE_0_ENTRY_2_ADDR_S  0

/** WCL_Core_0_ENTRY_3_ADDR_REG register
 *  Core_0 Entry 3 address configuration Register
 */
#define WCL_CORE_0_ENTRY_3_ADDR_REG (DR_REG_WCL_BASE + 0x8)
/** WCL_CORE_0_ENTRY_3_ADDR : R/W; bitpos: [31:0]; default: 0;
 *  Core_0 Entry 3 address from WORLD1 to WORLD0
 */
#define WCL_CORE_0_ENTRY_3_ADDR    0xFFFFFFFFU
#define WCL_CORE_0_ENTRY_3_ADDR_M  (WCL_CORE_0_ENTRY_3_ADDR_V << WCL_CORE_0_ENTRY_3_ADDR_S)
#define WCL_CORE_0_ENTRY_3_ADDR_V  0xFFFFFFFFU
#define WCL_CORE_0_ENTRY_3_ADDR_S  0

/** WCL_Core_0_ENTRY_4_ADDR_REG register
 *  Core_0 Entry 4 address configuration Register
 */
#define WCL_CORE_0_ENTRY_4_ADDR_REG (DR_REG_WCL_BASE + 0xc)
/** WCL_CORE_0_ENTRY_4_ADDR : R/W; bitpos: [31:0]; default: 0;
 *  Core_0 Entry 4 address from WORLD1 to WORLD0
 */
#define WCL_CORE_0_ENTRY_4_ADDR    0xFFFFFFFFU
#define WCL_CORE_0_ENTRY_4_ADDR_M  (WCL_CORE_0_ENTRY_4_ADDR_V << WCL_CORE_0_ENTRY_4_ADDR_S)
#define WCL_CORE_0_ENTRY_4_ADDR_V  0xFFFFFFFFU
#define WCL_CORE_0_ENTRY_4_ADDR_S  0

/** WCL_Core_0_ENTRY_5_ADDR_REG register
 *  Core_0 Entry 5 address configuration Register
 */
#define WCL_CORE_0_ENTRY_5_ADDR_REG (DR_REG_WCL_BASE + 0x10)
/** WCL_CORE_0_ENTRY_5_ADDR : R/W; bitpos: [31:0]; default: 0;
 *  Core_0 Entry 5 address from WORLD1 to WORLD0
 */
#define WCL_CORE_0_ENTRY_5_ADDR    0xFFFFFFFFU
#define WCL_CORE_0_ENTRY_5_ADDR_M  (WCL_CORE_0_ENTRY_5_ADDR_V << WCL_CORE_0_ENTRY_5_ADDR_S)
#define WCL_CORE_0_ENTRY_5_ADDR_V  0xFFFFFFFFU
#define WCL_CORE_0_ENTRY_5_ADDR_S  0

/** WCL_Core_0_ENTRY_6_ADDR_REG register
 *  Core_0 Entry 6 address configuration Register
 */
#define WCL_CORE_0_ENTRY_6_ADDR_REG (DR_REG_WCL_BASE + 0x14)
/** WCL_CORE_0_ENTRY_6_ADDR : R/W; bitpos: [31:0]; default: 0;
 *  Core_0 Entry 6 address from WORLD1 to WORLD0
 */
#define WCL_CORE_0_ENTRY_6_ADDR    0xFFFFFFFFU
#define WCL_CORE_0_ENTRY_6_ADDR_M  (WCL_CORE_0_ENTRY_6_ADDR_V << WCL_CORE_0_ENTRY_6_ADDR_S)
#define WCL_CORE_0_ENTRY_6_ADDR_V  0xFFFFFFFFU
#define WCL_CORE_0_ENTRY_6_ADDR_S  0

/** WCL_Core_0_ENTRY_7_ADDR_REG register
 *  Core_0 Entry 7 address configuration Register
 */
#define WCL_CORE_0_ENTRY_7_ADDR_REG (DR_REG_WCL_BASE + 0x18)
/** WCL_CORE_0_ENTRY_7_ADDR : R/W; bitpos: [31:0]; default: 0;
 *  Core_0 Entry 7 address from WORLD1 to WORLD0
 */
#define WCL_CORE_0_ENTRY_7_ADDR    0xFFFFFFFFU
#define WCL_CORE_0_ENTRY_7_ADDR_M  (WCL_CORE_0_ENTRY_7_ADDR_V << WCL_CORE_0_ENTRY_7_ADDR_S)
#define WCL_CORE_0_ENTRY_7_ADDR_V  0xFFFFFFFFU
#define WCL_CORE_0_ENTRY_7_ADDR_S  0

/** WCL_Core_0_ENTRY_8_ADDR_REG register
 *  Core_0 Entry 8 address configuration Register
 */
#define WCL_CORE_0_ENTRY_8_ADDR_REG (DR_REG_WCL_BASE + 0x1c)
/** WCL_CORE_0_ENTRY_8_ADDR : R/W; bitpos: [31:0]; default: 0;
 *  Core_0 Entry 8 address from WORLD1 to WORLD0
 */
#define WCL_CORE_0_ENTRY_8_ADDR    0xFFFFFFFFU
#define WCL_CORE_0_ENTRY_8_ADDR_M  (WCL_CORE_0_ENTRY_8_ADDR_V << WCL_CORE_0_ENTRY_8_ADDR_S)
#define WCL_CORE_0_ENTRY_8_ADDR_V  0xFFFFFFFFU
#define WCL_CORE_0_ENTRY_8_ADDR_S  0

/** WCL_Core_0_ENTRY_9_ADDR_REG register
 *  Core_0 Entry 9 address configuration Register
 */
#define WCL_CORE_0_ENTRY_9_ADDR_REG (DR_REG_WCL_BASE + 0x20)
/** WCL_CORE_0_ENTRY_9_ADDR : R/W; bitpos: [31:0]; default: 0;
 *  Core_0 Entry 9 address from WORLD1 to WORLD0
 */
#define WCL_CORE_0_ENTRY_9_ADDR    0xFFFFFFFFU
#define WCL_CORE_0_ENTRY_9_ADDR_M  (WCL_CORE_0_ENTRY_9_ADDR_V << WCL_CORE_0_ENTRY_9_ADDR_S)
#define WCL_CORE_0_ENTRY_9_ADDR_V  0xFFFFFFFFU
#define WCL_CORE_0_ENTRY_9_ADDR_S  0

/** WCL_Core_0_ENTRY_10_ADDR_REG register
 *  Core_0 Entry 10 address configuration Register
 */
#define WCL_CORE_0_ENTRY_10_ADDR_REG (DR_REG_WCL_BASE + 0x24)
/** WCL_CORE_0_ENTRY_10_ADDR : R/W; bitpos: [31:0]; default: 0;
 *  Core_0 Entry 10 address from WORLD1 to WORLD0
 */
#define WCL_CORE_0_ENTRY_10_ADDR    0xFFFFFFFFU
#define WCL_CORE_0_ENTRY_10_ADDR_M  (WCL_CORE_0_ENTRY_10_ADDR_V << WCL_CORE_0_ENTRY_10_ADDR_S)
#define WCL_CORE_0_ENTRY_10_ADDR_V  0xFFFFFFFFU
#define WCL_CORE_0_ENTRY_10_ADDR_S  0

/** WCL_Core_0_ENTRY_11_ADDR_REG register
 *  Core_0 Entry 11 address configuration Register
 */
#define WCL_CORE_0_ENTRY_11_ADDR_REG (DR_REG_WCL_BASE + 0x28)
/** WCL_CORE_0_ENTRY_11_ADDR : R/W; bitpos: [31:0]; default: 0;
 *  Core_0 Entry 11 address from WORLD1 to WORLD0
 */
#define WCL_CORE_0_ENTRY_11_ADDR    0xFFFFFFFFU
#define WCL_CORE_0_ENTRY_11_ADDR_M  (WCL_CORE_0_ENTRY_11_ADDR_V << WCL_CORE_0_ENTRY_11_ADDR_S)
#define WCL_CORE_0_ENTRY_11_ADDR_V  0xFFFFFFFFU
#define WCL_CORE_0_ENTRY_11_ADDR_S  0

/** WCL_Core_0_ENTRY_12_ADDR_REG register
 *  Core_0 Entry 12 address configuration Register
 */
#define WCL_CORE_0_ENTRY_12_ADDR_REG (DR_REG_WCL_BASE + 0x2c)
/** WCL_CORE_0_ENTRY_12_ADDR : R/W; bitpos: [31:0]; default: 0;
 *  Core_0 Entry 12 address from WORLD1 to WORLD0
 */
#define WCL_CORE_0_ENTRY_12_ADDR    0xFFFFFFFFU
#define WCL_CORE_0_ENTRY_12_ADDR_M  (WCL_CORE_0_ENTRY_12_ADDR_V << WCL_CORE_0_ENTRY_12_ADDR_S)
#define WCL_CORE_0_ENTRY_12_ADDR_V  0xFFFFFFFFU
#define WCL_CORE_0_ENTRY_12_ADDR_S  0

/** WCL_Core_0_ENTRY_13_ADDR_REG register
 *  Core_0 Entry 13 address configuration Register
 */
#define WCL_CORE_0_ENTRY_13_ADDR_REG (DR_REG_WCL_BASE + 0x30)
/** WCL_CORE_0_ENTRY_13_ADDR : R/W; bitpos: [31:0]; default: 0;
 *  Core_0 Entry 13 address from WORLD1 to WORLD0
 */
#define WCL_CORE_0_ENTRY_13_ADDR    0xFFFFFFFFU
#define WCL_CORE_0_ENTRY_13_ADDR_M  (WCL_CORE_0_ENTRY_13_ADDR_V << WCL_CORE_0_ENTRY_13_ADDR_S)
#define WCL_CORE_0_ENTRY_13_ADDR_V  0xFFFFFFFFU
#define WCL_CORE_0_ENTRY_13_ADDR_S  0

/** WCL_Core_0_ENTRY_CHECK_REG register
 *  Core_0 Entry check configuration Register
 */
#define WCL_CORE_0_ENTRY_CHECK_REG (DR_REG_WCL_BASE + 0x7c)
/** WCL_CORE_0_ENTRY_CHECK : R/W; bitpos: [13:1]; default: 1;
 *  This filed is used to enable entry address check
 */
#define WCL_CORE_0_ENTRY_CHECK    0x00001FFFU
#define WCL_CORE_0_ENTRY_CHECK_M  (WCL_CORE_0_ENTRY_CHECK_V << WCL_CORE_0_ENTRY_CHECK_S)
#define WCL_CORE_0_ENTRY_CHECK_V  0x00001FFFU
#define WCL_CORE_0_ENTRY_CHECK_S  1

