espressif/esp-idf/components/soc/esp32s3/register/soc/world_controller_reg.h
/** WCL_Core_0_STATUSTABLE8_REG register
 *  Status register of world switch of entry 8
 */
#define WCL_CORE_0_STATUSTABLE8_REG (DR_REG_WCL_BASE + 0x9c)
/** WCL_CORE_0_FROM_WORLD_8 : R/W; bitpos: [0]; default: 0;
 *  This bit is used to confirm world before enter entry 8
 */
#define WCL_CORE_0_FROM_WORLD_8    (BIT(0))
#define WCL_CORE_0_FROM_WORLD_8_M  (WCL_CORE_0_FROM_WORLD_8_V << WCL_CORE_0_FROM_WORLD_8_S)
#define WCL_CORE_0_FROM_WORLD_8_V  0x00000001U
#define WCL_CORE_0_FROM_WORLD_8_S  0
/** WCL_CORE_0_FROM_ENTRY_8 : R/W; bitpos: [4:1]; default: 0;
 *  This filed is used to confirm in which entry before enter entry 8
 */
#define WCL_CORE_0_FROM_ENTRY_8    0x0000000FU
#define WCL_CORE_0_FROM_ENTRY_8_M  (WCL_CORE_0_FROM_ENTRY_8_V << WCL_CORE_0_FROM_ENTRY_8_S)
#define WCL_CORE_0_FROM_ENTRY_8_V  0x0000000FU
#define WCL_CORE_0_FROM_ENTRY_8_S  1
/** WCL_CORE_0_CURRENT_8 : R/W; bitpos: [5]; default: 0;
 *  This bit is used to confirm whether the current state is in entry 8
 */
#define WCL_CORE_0_CURRENT_8    (BIT(5))
#define WCL_CORE_0_CURRENT_8_M  (WCL_CORE_0_CURRENT_8_V << WCL_CORE_0_CURRENT_8_S)
#define WCL_CORE_0_CURRENT_8_V  0x00000001U
#define WCL_CORE_0_CURRENT_8_S  5

/** WCL_Core_0_STATUSTABLE9_REG register
 *  Status register of world switch of entry 9
 */
#define WCL_CORE_0_STATUSTABLE9_REG (DR_REG_WCL_BASE + 0xa0)
/** WCL_CORE_0_FROM_WORLD_9 : R/W; bitpos: [0]; default: 0;
 *  This bit is used to confirm world before enter entry 9
 */
#define WCL_CORE_0_FROM_WORLD_9    (BIT(0))
#define WCL_CORE_0_FROM_WORLD_9_M  (WCL_CORE_0_FROM_WORLD_9_V << WCL_CORE_0_FROM_WORLD_9_S)
#define WCL_CORE_0_FROM_WORLD_9_V  0x00000001U
#define WCL_CORE_0_FROM_WORLD_9_S  0
/** WCL_CORE_0_FROM_ENTRY_9 : R/W; bitpos: [4:1]; default: 0;
 *  This filed is used to confirm in which entry before enter entry 9
 */
#define WCL_CORE_0_FROM_ENTRY_9    0x0000000FU
#define WCL_CORE_0_FROM_ENTRY_9_M  (WCL_CORE_0_FROM_ENTRY_9_V << WCL_CORE_0_FROM_ENTRY_9_S)
#define WCL_CORE_0_FROM_ENTRY_9_V  0x0000000FU
#define WCL_CORE_0_FROM_ENTRY_9_S  1
/** WCL_CORE_0_CURRENT_9 : R/W; bitpos: [5]; default: 0;
 *  This bit is used to confirm whether the current state is in entry 9
 */
#define WCL_CORE_0_CURRENT_9    (BIT(5))
#define WCL_CORE_0_CURRENT_9_M  (WCL_CORE_0_CURRENT_9_V << WCL_CORE_0_CURRENT_9_S)
#define WCL_CORE_0_CURRENT_9_V  0x00000001U
#define WCL_CORE_0_CURRENT_9_S  5

/** WCL_Core_0_STATUSTABLE10_REG register
 *  Status register of world switch of entry 10
 */
#define WCL_CORE_0_STATUSTABLE10_REG (DR_REG_WCL_BASE + 0xa4)
/** WCL_CORE_0_FROM_WORLD_10 : R/W; bitpos: [0]; default: 0;
 *  This bit is used to confirm world before enter entry 10
 */
#define WCL_CORE_0_FROM_WORLD_10    (BIT(0))
#define WCL_CORE_0_FROM_WORLD_10_M  (WCL_CORE_0_FROM_WORLD_10_V << WCL_CORE_0_FROM_WORLD_10_S)
#define WCL_CORE_0_FROM_WORLD_10_V  0x00000001U
#define WCL_CORE_0_FROM_WORLD_10_S  0
/** WCL_CORE_0_FROM_ENTRY_10 : R/W; bitpos: [4:1]; default: 0;
 *  This filed is used to confirm in which entry before enter entry 10
 */
#define WCL_CORE_0_FROM_ENTRY_10    0x0000000FU
#define WCL_CORE_0_FROM_ENTRY_10_M  (WCL_CORE_0_FROM_ENTRY_10_V << WCL_CORE_0_FROM_ENTRY_10_S)
#define WCL_CORE_0_FROM_ENTRY_10_V  0x0000000FU
#define WCL_CORE_0_FROM_ENTRY_10_S  1
/** WCL_CORE_0_CURRENT_10 : R/W; bitpos: [5]; default: 0;
 *  This bit is used to confirm whether the current state is in entry 10
 */
#define WCL_CORE_0_CURRENT_10    (BIT(5))
#define WCL_CORE_0_CURRENT_10_M  (WCL_CORE_0_CURRENT_10_V << WCL_CORE_0_CURRENT_10_S)
#define WCL_CORE_0_CURRENT_10_V  0x00000001U
#define WCL_CORE_0_CURRENT_10_S  5

/** WCL_Core_0_STATUSTABLE11_REG register
 *  Status register of world switch of entry 11
 */
#define WCL_CORE_0_STATUSTABLE11_REG (DR_REG_WCL_BASE + 0xa8)
/** WCL_CORE_0_FROM_WORLD_11 : R/W; bitpos: [0]; default: 0;
 *  This bit is used to confirm world before enter entry 11
 */
#define WCL_CORE_0_FROM_WORLD_11    (BIT(0))
#define WCL_CORE_0_FROM_WORLD_11_M  (WCL_CORE_0_FROM_WORLD_11_V << WCL_CORE_0_FROM_WORLD_11_S)
#define WCL_CORE_0_FROM_WORLD_11_V  0x00000001U
#define WCL_CORE_0_FROM_WORLD_11_S  0
/** WCL_CORE_0_FROM_ENTRY_11 : R/W; bitpos: [4:1]; default: 0;
 *  This filed is used to confirm in which entry before enter entry 11
 */
#define WCL_CORE_0_FROM_ENTRY_11    0x0000000FU
#define WCL_CORE_0_FROM_ENTRY_11_M  (WCL_CORE_0_FROM_ENTRY_11_V << WCL_CORE_0_FROM_ENTRY_11_S)
#define WCL_CORE_0_FROM_ENTRY_11_V  0x0000000FU
#define WCL_CORE_0_FROM_ENTRY_11_S  1
/** WCL_CORE_0_CURRENT_11 : R/W; bitpos: [5]; default: 0;
 *  This bit is used to confirm whether the current state is in entry 11
 */
#define WCL_CORE_0_CURRENT_11    (BIT(5))
#define WCL_CORE_0_CURRENT_11_M  (WCL_CORE_0_CURRENT_11_V << WCL_CORE_0_CURRENT_11_S)
#define WCL_CORE_0_CURRENT_11_V  0x00000001U
#define WCL_CORE_0_CURRENT_11_S  5

/** WCL_Core_0_STATUSTABLE12_REG register
 *  Status register of world switch of entry 12
 */
#define WCL_CORE_0_STATUSTABLE12_REG (DR_REG_WCL_BASE + 0xac)
/** WCL_CORE_0_FROM_WORLD_12 : R/W; bitpos: [0]; default: 0;
 *  This bit is used to confirm world before enter entry 12
 */
#define WCL_CORE_0_FROM_WORLD_12    (BIT(0))
#define WCL_CORE_0_FROM_WORLD_12_M  (WCL_CORE_0_FROM_WORLD_12_V << WCL_CORE_0_FROM_WORLD_12_S)
#define WCL_CORE_0_FROM_WORLD_12_V  0x00000001U
#define WCL_CORE_0_FROM_WORLD_12_S  0
/** WCL_CORE_0_FROM_ENTRY_12 : R/W; bitpos: [4:1]; default: 0;
 *  This filed is used to confirm in which entry before enter entry 12
 */
#define WCL_CORE_0_FROM_ENTRY_12    0x0000000FU
#define WCL_CORE_0_FROM_ENTRY_12_M  (WCL_CORE_0_FROM_ENTRY_12_V << WCL_CORE_0_FROM_ENTRY_12_S)
#define WCL_CORE_0_FROM_ENTRY_12_V  0x0000000FU
#define WCL_CORE_0_FROM_ENTRY_12_S  1
/** WCL_CORE_0_CURRENT_12 : R/W; bitpos: [5]; default: 0;
 *  This bit is used to confirm whether the current state is in entry 12
 */
#define WCL_CORE_0_CURRENT_12    (BIT(5))
#define WCL_CORE_0_CURRENT_12_M  (WCL_CORE_0_CURRENT_12_V << WCL_CORE_0_CURRENT_12_S)
#define WCL_CORE_0_CURRENT_12_V  0x00000001U
#define WCL_CORE_0_CURRENT_12_S  5

