espressif/esp-idf/components/soc/esp32s3/register/soc/world_controller_reg.h
/** WCL_Core_0_STATUSTABLE13_REG register
 *  Status register of world switch of entry 13
 */
#define WCL_CORE_0_STATUSTABLE13_REG (DR_REG_WCL_BASE + 0xb0)
/** WCL_CORE_0_FROM_WORLD_13 : R/W; bitpos: [0]; default: 0;
 *  This bit is used to confirm world before enter entry 13
 */
#define WCL_CORE_0_FROM_WORLD_13    (BIT(0))
#define WCL_CORE_0_FROM_WORLD_13_M  (WCL_CORE_0_FROM_WORLD_13_V << WCL_CORE_0_FROM_WORLD_13_S)
#define WCL_CORE_0_FROM_WORLD_13_V  0x00000001U
#define WCL_CORE_0_FROM_WORLD_13_S  0
/** WCL_CORE_0_FROM_ENTRY_13 : R/W; bitpos: [4:1]; default: 0;
 *  This filed is used to confirm in which entry before enter entry 13
 */
#define WCL_CORE_0_FROM_ENTRY_13    0x0000000FU
#define WCL_CORE_0_FROM_ENTRY_13_M  (WCL_CORE_0_FROM_ENTRY_13_V << WCL_CORE_0_FROM_ENTRY_13_S)
#define WCL_CORE_0_FROM_ENTRY_13_V  0x0000000FU
#define WCL_CORE_0_FROM_ENTRY_13_S  1
/** WCL_CORE_0_CURRENT_13 : R/W; bitpos: [5]; default: 0;
 *  This bit is used to confirm whether the current state is in entry 13
 */
#define WCL_CORE_0_CURRENT_13    (BIT(5))
#define WCL_CORE_0_CURRENT_13_M  (WCL_CORE_0_CURRENT_13_V << WCL_CORE_0_CURRENT_13_S)
#define WCL_CORE_0_CURRENT_13_V  0x00000001U
#define WCL_CORE_0_CURRENT_13_S  5

/** WCL_Core_0_STATUSTABLE_CURRENT_REG register
 *  Status register of statustable current
 */
#define WCL_CORE_0_STATUSTABLE_CURRENT_REG (DR_REG_WCL_BASE + 0xfc)
/** WCL_CORE_0_STATUSTABLE_CURRENT : R/W; bitpos: [13:1]; default: 0;
 *  This field is used to quickly read and rewrite the current field of all STATUSTABLE
 *  registers,for example,bit 1 represents the current field of STATUSTABLE1,bit2
 *  represents the current field of STATUSTABLE2
 */
#define WCL_CORE_0_STATUSTABLE_CURRENT    0x00001FFFU
#define WCL_CORE_0_STATUSTABLE_CURRENT_M  (WCL_CORE_0_STATUSTABLE_CURRENT_V << WCL_CORE_0_STATUSTABLE_CURRENT_S)
#define WCL_CORE_0_STATUSTABLE_CURRENT_V  0x00001FFFU
#define WCL_CORE_0_STATUSTABLE_CURRENT_S  1

/** WCL_Core_0_MESSAGE_ADDR_REG register
 *  Clear writer_buffer write address configuration register
 */
#define WCL_CORE_0_MESSAGE_ADDR_REG (DR_REG_WCL_BASE + 0x100)
/** WCL_CORE_0_MESSAGE_ADDR : R/W; bitpos: [31:0]; default: 0;
 *  This field is used to set address that need to write when enter WORLD0
 */
#define WCL_CORE_0_MESSAGE_ADDR    0xFFFFFFFFU
#define WCL_CORE_0_MESSAGE_ADDR_M  (WCL_CORE_0_MESSAGE_ADDR_V << WCL_CORE_0_MESSAGE_ADDR_S)
#define WCL_CORE_0_MESSAGE_ADDR_V  0xFFFFFFFFU
#define WCL_CORE_0_MESSAGE_ADDR_S  0

/** WCL_Core_0_MESSAGE_MAX_REG register
 *  Clear writer_buffer write number configuration register
 */
#define WCL_CORE_0_MESSAGE_MAX_REG (DR_REG_WCL_BASE + 0x104)
/** WCL_CORE_0_MESSAGE_MAX : R/W; bitpos: [3:0]; default: 0;
 *  This filed is used to set the max value of clear write_buffer
 */
#define WCL_CORE_0_MESSAGE_MAX    0x0000000FU
#define WCL_CORE_0_MESSAGE_MAX_M  (WCL_CORE_0_MESSAGE_MAX_V << WCL_CORE_0_MESSAGE_MAX_S)
#define WCL_CORE_0_MESSAGE_MAX_V  0x0000000FU
#define WCL_CORE_0_MESSAGE_MAX_S  0

/** WCL_Core_0_MESSAGE_PHASE_REG register
 *  Clear writer_buffer status register
 */
#define WCL_CORE_0_MESSAGE_PHASE_REG (DR_REG_WCL_BASE + 0x108)
/** WCL_CORE_0_MESSAGE_MATCH : RO; bitpos: [0]; default: 0;
 *  This bit indicates whether the check is successful
 */
#define WCL_CORE_0_MESSAGE_MATCH    (BIT(0))
#define WCL_CORE_0_MESSAGE_MATCH_M  (WCL_CORE_0_MESSAGE_MATCH_V << WCL_CORE_0_MESSAGE_MATCH_S)
#define WCL_CORE_0_MESSAGE_MATCH_V  0x00000001U
#define WCL_CORE_0_MESSAGE_MATCH_S  0
/** WCL_CORE_0_MESSAGE_EXPECT : RO; bitpos: [4:1]; default: 0;
 *  This field indicates the data to be written next time
 */
#define WCL_CORE_0_MESSAGE_EXPECT    0x0000000FU
#define WCL_CORE_0_MESSAGE_EXPECT_M  (WCL_CORE_0_MESSAGE_EXPECT_V << WCL_CORE_0_MESSAGE_EXPECT_S)
#define WCL_CORE_0_MESSAGE_EXPECT_V  0x0000000FU
#define WCL_CORE_0_MESSAGE_EXPECT_S  1
/** WCL_CORE_0_MESSAGE_DATAPHASE : RO; bitpos: [5]; default: 0;
 *  If this bit is 1, it means that is checking clear write_buffer operation,and is
 *  checking data
 */
#define WCL_CORE_0_MESSAGE_DATAPHASE    (BIT(5))
#define WCL_CORE_0_MESSAGE_DATAPHASE_M  (WCL_CORE_0_MESSAGE_DATAPHASE_V << WCL_CORE_0_MESSAGE_DATAPHASE_S)
#define WCL_CORE_0_MESSAGE_DATAPHASE_V  0x00000001U
#define WCL_CORE_0_MESSAGE_DATAPHASE_S  5
/** WCL_CORE_0_MESSAGE_ADDRESSPHASE : RO; bitpos: [6]; default: 0;
 *  If this bit is 1, it means that is checking clear write_buffer operation,and is
 *  checking address.
 */
#define WCL_CORE_0_MESSAGE_ADDRESSPHASE    (BIT(6))
#define WCL_CORE_0_MESSAGE_ADDRESSPHASE_M  (WCL_CORE_0_MESSAGE_ADDRESSPHASE_V << WCL_CORE_0_MESSAGE_ADDRESSPHASE_S)
#define WCL_CORE_0_MESSAGE_ADDRESSPHASE_V  0x00000001U
#define WCL_CORE_0_MESSAGE_ADDRESSPHASE_S  6

/** WCL_Core_0_World_TRIGGER_ADDR_REG register
 *  Core_0 trigger address configuration Register
 */
#define WCL_CORE_0_WORLD_TRIGGER_ADDR_REG (DR_REG_WCL_BASE + 0x140)
/** WCL_CORE_0_WORLD_TRIGGER_ADDR : RW; bitpos: [31:0]; default: 0;
 *  This field is used to configure the entry address from WORLD0 to WORLD1,when the
 *  CPU executes to this address,switch to WORLD1
 */
#define WCL_CORE_0_WORLD_TRIGGER_ADDR    0xFFFFFFFFU
#define WCL_CORE_0_WORLD_TRIGGER_ADDR_M  (WCL_CORE_0_WORLD_TRIGGER_ADDR_V << WCL_CORE_0_WORLD_TRIGGER_ADDR_S)
#define WCL_CORE_0_WORLD_TRIGGER_ADDR_V  0xFFFFFFFFU
#define WCL_CORE_0_WORLD_TRIGGER_ADDR_S  0

/** WCL_Core_0_World_PREPARE_REG register
 *  Core_0 prepare world configuration Register
 */
#define WCL_CORE_0_WORLD_PREPARE_REG (DR_REG_WCL_BASE + 0x144)
/** WCL_CORE_0_WORLD_PREPARE : R/W; bitpos: [1:0]; default: 0;
 *  This field to used to set world to enter,  2'b01 means WORLD0, 2'b10 means WORLD1
 */
#define WCL_CORE_0_WORLD_PREPARE    0x00000003U
#define WCL_CORE_0_WORLD_PREPARE_M  (WCL_CORE_0_WORLD_PREPARE_V << WCL_CORE_0_WORLD_PREPARE_S)
#define WCL_CORE_0_WORLD_PREPARE_V  0x00000003U
#define WCL_CORE_0_WORLD_PREPARE_S  0

/** WCL_Core_0_World_UPDATE_REG register
 *  Core_0 configuration update register
 */
#define WCL_CORE_0_WORLD_UPDATE_REG (DR_REG_WCL_BASE + 0x148)
/** WCL_CORE_0_UPDATE : WO; bitpos: [31:0]; default: 0;
 *  This field is used to update configuration completed, can write any value,the
 *  hardware only checks the write operation of this register and does not case about
 *  its value
 */
#define WCL_CORE_0_UPDATE    0xFFFFFFFFU
#define WCL_CORE_0_UPDATE_M  (WCL_CORE_0_UPDATE_V << WCL_CORE_0_UPDATE_S)
#define WCL_CORE_0_UPDATE_V  0xFFFFFFFFU
#define WCL_CORE_0_UPDATE_S  0

/** WCL_Core_0_World_Cancel_REG register
 *  Core_0 configuration cancel register
 */
#define WCL_CORE_0_WORLD_CANCEL_REG (DR_REG_WCL_BASE + 0x14c)
/** WCL_CORE_0_WORLD_CANCEL : WO; bitpos: [31:0]; default: 0;
 *  This field is used to cancel switch world configuration,if the trigger address and
 *  update configuration complete,use this register to cancel world switch, jujst need
 *  write any value,the hardware only checks the write operation of this register and
 *  does not case about its value
 */
#define WCL_CORE_0_WORLD_CANCEL    0xFFFFFFFFU
#define WCL_CORE_0_WORLD_CANCEL_M  (WCL_CORE_0_WORLD_CANCEL_V << WCL_CORE_0_WORLD_CANCEL_S)
#define WCL_CORE_0_WORLD_CANCEL_V  0xFFFFFFFFU
#define WCL_CORE_0_WORLD_CANCEL_S  0

/** WCL_Core_0_World_IRam0_REG register
 *  Core_0 Iram0 world register
 */
#define WCL_CORE_0_WORLD_IRAM0_REG (DR_REG_WCL_BASE + 0x150)
/** WCL_CORE_0_WORLD_IRAM0 : R/W; bitpos: [1:0]; default: 0;
 *  this field is used to read current world of Iram0 bus
 */
#define WCL_CORE_0_WORLD_IRAM0    0x00000003U
#define WCL_CORE_0_WORLD_IRAM0_M  (WCL_CORE_0_WORLD_IRAM0_V << WCL_CORE_0_WORLD_IRAM0_S)
#define WCL_CORE_0_WORLD_IRAM0_V  0x00000003U
#define WCL_CORE_0_WORLD_IRAM0_S  0

/** WCL_Core_0_World_DRam0_PIF_REG register
 *  Core_0 dram0 and PIF world register
 */
#define WCL_CORE_0_WORLD_DRAM0_PIF_REG (DR_REG_WCL_BASE + 0x154)
/** WCL_CORE_0_WORLD_DRAM0_PIF : R/W; bitpos: [1:0]; default: 0;
 *  this field is used to read current world of Dram0 bus and PIF bus
 */
#define WCL_CORE_0_WORLD_DRAM0_PIF    0x00000003U
#define WCL_CORE_0_WORLD_DRAM0_PIF_M  (WCL_CORE_0_WORLD_DRAM0_PIF_V << WCL_CORE_0_WORLD_DRAM0_PIF_S)
#define WCL_CORE_0_WORLD_DRAM0_PIF_V  0x00000003U
#define WCL_CORE_0_WORLD_DRAM0_PIF_S  0

/** WCL_Core_0_World_Phase_REG register
 *  Core_0 world status register
 */
#define WCL_CORE_0_WORLD_PHASE_REG (DR_REG_WCL_BASE + 0x158)
/** WCL_CORE_0_WORLD_PHASE : RO; bitpos: [0]; default: 0;
 *  This bit indicates whether is preparing to switch to WORLD1, 1 means value.
 */
#define WCL_CORE_0_WORLD_PHASE    (BIT(0))
#define WCL_CORE_0_WORLD_PHASE_M  (WCL_CORE_0_WORLD_PHASE_V << WCL_CORE_0_WORLD_PHASE_S)
#define WCL_CORE_0_WORLD_PHASE_V  0x00000001U
#define WCL_CORE_0_WORLD_PHASE_S  0

/** WCL_Core_0_NMI_MASK_ENABLE_REG register
 *  Core_0 NMI mask enable register
 */
#define WCL_CORE_0_NMI_MASK_ENABLE_REG (DR_REG_WCL_BASE + 0x180)
/** WCL_CORE_0_NMI_MASK_ENABLE : WO; bitpos: [31:0]; default: 0;
 *  this field is used to set NMI mask,it can write any value,when write this
 *  register,the hardware start masking NMI interrupt
 */
#define WCL_CORE_0_NMI_MASK_ENABLE    0xFFFFFFFFU
#define WCL_CORE_0_NMI_MASK_ENABLE_M  (WCL_CORE_0_NMI_MASK_ENABLE_V << WCL_CORE_0_NMI_MASK_ENABLE_S)
#define WCL_CORE_0_NMI_MASK_ENABLE_V  0xFFFFFFFFU
#define WCL_CORE_0_NMI_MASK_ENABLE_S  0

/** WCL_Core_0_NMI_MASK_TRIGGER_ADDR_REG register
 *  Core_0 NMI mask trigger address register
 */
#define WCL_CORE_0_NMI_MASK_TRIGGER_ADDR_REG (DR_REG_WCL_BASE + 0x184)
/** WCL_CORE_0_NMI_MASK_TRIGGER_ADDR : R/W; bitpos: [31:0]; default: 0;
 *  this field to used to set trigger address, when CPU executes to this address,NMI
 *  mask automatically fails
 */
#define WCL_CORE_0_NMI_MASK_TRIGGER_ADDR    0xFFFFFFFFU
#define WCL_CORE_0_NMI_MASK_TRIGGER_ADDR_M  (WCL_CORE_0_NMI_MASK_TRIGGER_ADDR_V << WCL_CORE_0_NMI_MASK_TRIGGER_ADDR_S)
#define WCL_CORE_0_NMI_MASK_TRIGGER_ADDR_V  0xFFFFFFFFU
#define WCL_CORE_0_NMI_MASK_TRIGGER_ADDR_S  0

/** WCL_Core_0_NMI_MASK_DISABLE_REG register
 *  Core_0 NMI mask disable register
 */
#define WCL_CORE_0_NMI_MASK_DISABLE_REG (DR_REG_WCL_BASE + 0x188)
/** WCL_CORE_0_NMI_MASK_DISABLE : WO; bitpos: [31:0]; default: 0;
 *  this field is used to disable NMI mask,it will not take effect immediately,only
 *  when the CPU executes to the trigger address will it start to cancel NMI mask
 */
#define WCL_CORE_0_NMI_MASK_DISABLE    0xFFFFFFFFU
#define WCL_CORE_0_NMI_MASK_DISABLE_M  (WCL_CORE_0_NMI_MASK_DISABLE_V << WCL_CORE_0_NMI_MASK_DISABLE_S)
#define WCL_CORE_0_NMI_MASK_DISABLE_V  0xFFFFFFFFU
#define WCL_CORE_0_NMI_MASK_DISABLE_S  0

