espressif/esp-idf/components/soc/esp32s3/register/soc/world_controller_reg.h
/** WCL_Core_0_NMI_MASK_CANCLE_REG register
 *  Core_0 NMI mask disable register
 */
#define WCL_CORE_0_NMI_MASK_CANCLE_REG (DR_REG_WCL_BASE + 0x18c)
/** WCL_CORE_0_NMI_MASK_CANCEL : WO; bitpos: [31:0]; default: 0;
 *  this field is used to cancel NMI mask disable function.
 */
#define WCL_CORE_0_NMI_MASK_CANCEL    0xFFFFFFFFU
#define WCL_CORE_0_NMI_MASK_CANCEL_M  (WCL_CORE_0_NMI_MASK_CANCEL_V << WCL_CORE_0_NMI_MASK_CANCEL_S)
#define WCL_CORE_0_NMI_MASK_CANCEL_V  0xFFFFFFFFU
#define WCL_CORE_0_NMI_MASK_CANCEL_S  0

/** WCL_Core_0_NMI_MASK_REG register
 *  Core_0 NMI mask register
 */
#define WCL_CORE_0_NMI_MASK_REG (DR_REG_WCL_BASE + 0x190)
/** WCL_CORE_0_NMI_MASK : R/W; bitpos: [0]; default: 0;
 *  this bit is used to mask NMI interrupt,it can directly mask NMI interrupt
 */
#define WCL_CORE_0_NMI_MASK    (BIT(0))
#define WCL_CORE_0_NMI_MASK_M  (WCL_CORE_0_NMI_MASK_V << WCL_CORE_0_NMI_MASK_S)
#define WCL_CORE_0_NMI_MASK_V  0x00000001U
#define WCL_CORE_0_NMI_MASK_S  0

/** WCL_Core_0_NMI_MASK_PHASE_REG register
 *  Core_0 NMI mask phase register
 */
#define WCL_CORE_0_NMI_MASK_PHASE_REG (DR_REG_WCL_BASE + 0x194)
/** WCL_CORE_0_NMI_MASK_PHASE : RO; bitpos: [0]; default: 0;
 *  this bit is used to indicates whether the NMI interrupt is being masked, 1 means
 *  NMI interrupt is being masked
 */
#define WCL_CORE_0_NMI_MASK_PHASE    (BIT(0))
#define WCL_CORE_0_NMI_MASK_PHASE_M  (WCL_CORE_0_NMI_MASK_PHASE_V << WCL_CORE_0_NMI_MASK_PHASE_S)
#define WCL_CORE_0_NMI_MASK_PHASE_V  0x00000001U
#define WCL_CORE_0_NMI_MASK_PHASE_S  0

/** WCL_Core_1_ENTRY_1_ADDR_REG register
 *  Core_1 Entry 1 address configuration Register
 */
#define WCL_CORE_1_ENTRY_1_ADDR_REG (DR_REG_WCL_BASE + 0x400)
/** WCL_CORE_1_ENTRY_1_ADDR : R/W; bitpos: [31:0]; default: 0;
 *  Core_1 Entry 1 address from WORLD1 to WORLD0
 */
#define WCL_CORE_1_ENTRY_1_ADDR    0xFFFFFFFFU
#define WCL_CORE_1_ENTRY_1_ADDR_M  (WCL_CORE_1_ENTRY_1_ADDR_V << WCL_CORE_1_ENTRY_1_ADDR_S)
#define WCL_CORE_1_ENTRY_1_ADDR_V  0xFFFFFFFFU
#define WCL_CORE_1_ENTRY_1_ADDR_S  0

/** WCL_Core_1_ENTRY_2_ADDR_REG register
 *  Core_1 Entry 2 address configuration Register
 */
#define WCL_CORE_1_ENTRY_2_ADDR_REG (DR_REG_WCL_BASE + 0x404)
/** WCL_CORE_1_ENTRY_2_ADDR : R/W; bitpos: [31:0]; default: 0;
 *  Core_1 Entry 2 address from WORLD1 to WORLD0
 */
#define WCL_CORE_1_ENTRY_2_ADDR    0xFFFFFFFFU
#define WCL_CORE_1_ENTRY_2_ADDR_M  (WCL_CORE_1_ENTRY_2_ADDR_V << WCL_CORE_1_ENTRY_2_ADDR_S)
#define WCL_CORE_1_ENTRY_2_ADDR_V  0xFFFFFFFFU
#define WCL_CORE_1_ENTRY_2_ADDR_S  0

/** WCL_Core_1_ENTRY_3_ADDR_REG register
 *  Core_1 Entry 3 address configuration Register
 */
#define WCL_CORE_1_ENTRY_3_ADDR_REG (DR_REG_WCL_BASE + 0x408)
/** WCL_CORE_1_ENTRY_3_ADDR : R/W; bitpos: [31:0]; default: 0;
 *  Core_1 Entry 3 address from WORLD1 to WORLD0
 */
#define WCL_CORE_1_ENTRY_3_ADDR    0xFFFFFFFFU
#define WCL_CORE_1_ENTRY_3_ADDR_M  (WCL_CORE_1_ENTRY_3_ADDR_V << WCL_CORE_1_ENTRY_3_ADDR_S)
#define WCL_CORE_1_ENTRY_3_ADDR_V  0xFFFFFFFFU
#define WCL_CORE_1_ENTRY_3_ADDR_S  0

/** WCL_Core_1_ENTRY_4_ADDR_REG register
 *  Core_1 Entry 4 address configuration Register
 */
#define WCL_CORE_1_ENTRY_4_ADDR_REG (DR_REG_WCL_BASE + 0x40c)
/** WCL_CORE_1_ENTRY_4_ADDR : R/W; bitpos: [31:0]; default: 0;
 *  Core_1 Entry 4 address from WORLD1 to WORLD0
 */
#define WCL_CORE_1_ENTRY_4_ADDR    0xFFFFFFFFU
#define WCL_CORE_1_ENTRY_4_ADDR_M  (WCL_CORE_1_ENTRY_4_ADDR_V << WCL_CORE_1_ENTRY_4_ADDR_S)
#define WCL_CORE_1_ENTRY_4_ADDR_V  0xFFFFFFFFU
#define WCL_CORE_1_ENTRY_4_ADDR_S  0

/** WCL_Core_1_ENTRY_5_ADDR_REG register
 *  Core_1 Entry 5 address configuration Register
 */
#define WCL_CORE_1_ENTRY_5_ADDR_REG (DR_REG_WCL_BASE + 0x410)
/** WCL_CORE_1_ENTRY_5_ADDR : R/W; bitpos: [31:0]; default: 0;
 *  Core_1 Entry 5 address from WORLD1 to WORLD0
 */
#define WCL_CORE_1_ENTRY_5_ADDR    0xFFFFFFFFU
#define WCL_CORE_1_ENTRY_5_ADDR_M  (WCL_CORE_1_ENTRY_5_ADDR_V << WCL_CORE_1_ENTRY_5_ADDR_S)
#define WCL_CORE_1_ENTRY_5_ADDR_V  0xFFFFFFFFU
#define WCL_CORE_1_ENTRY_5_ADDR_S  0

/** WCL_Core_1_ENTRY_6_ADDR_REG register
 *  Core_1 Entry 6 address configuration Register
 */
#define WCL_CORE_1_ENTRY_6_ADDR_REG (DR_REG_WCL_BASE + 0x414)
/** WCL_CORE_1_ENTRY_6_ADDR : R/W; bitpos: [31:0]; default: 0;
 *  Core_1 Entry 6 address from WORLD1 to WORLD0
 */
#define WCL_CORE_1_ENTRY_6_ADDR    0xFFFFFFFFU
#define WCL_CORE_1_ENTRY_6_ADDR_M  (WCL_CORE_1_ENTRY_6_ADDR_V << WCL_CORE_1_ENTRY_6_ADDR_S)
#define WCL_CORE_1_ENTRY_6_ADDR_V  0xFFFFFFFFU
#define WCL_CORE_1_ENTRY_6_ADDR_S  0

/** WCL_Core_1_ENTRY_7_ADDR_REG register
 *  Core_1 Entry 7 address configuration Register
 */
#define WCL_CORE_1_ENTRY_7_ADDR_REG (DR_REG_WCL_BASE + 0x418)
/** WCL_CORE_1_ENTRY_7_ADDR : R/W; bitpos: [31:0]; default: 0;
 *  Core_1 Entry 7 address from WORLD1 to WORLD0
 */
#define WCL_CORE_1_ENTRY_7_ADDR    0xFFFFFFFFU
#define WCL_CORE_1_ENTRY_7_ADDR_M  (WCL_CORE_1_ENTRY_7_ADDR_V << WCL_CORE_1_ENTRY_7_ADDR_S)
#define WCL_CORE_1_ENTRY_7_ADDR_V  0xFFFFFFFFU
#define WCL_CORE_1_ENTRY_7_ADDR_S  0

/** WCL_Core_1_ENTRY_8_ADDR_REG register
 *  Core_1 Entry 8 address configuration Register
 */
#define WCL_CORE_1_ENTRY_8_ADDR_REG (DR_REG_WCL_BASE + 0x41c)
/** WCL_CORE_1_ENTRY_8_ADDR : R/W; bitpos: [31:0]; default: 0;
 *  Core_1 Entry 8 address from WORLD1 to WORLD0
 */
#define WCL_CORE_1_ENTRY_8_ADDR    0xFFFFFFFFU
#define WCL_CORE_1_ENTRY_8_ADDR_M  (WCL_CORE_1_ENTRY_8_ADDR_V << WCL_CORE_1_ENTRY_8_ADDR_S)
#define WCL_CORE_1_ENTRY_8_ADDR_V  0xFFFFFFFFU
#define WCL_CORE_1_ENTRY_8_ADDR_S  0

/** WCL_Core_1_ENTRY_9_ADDR_REG register
 *  Core_1 Entry 9 address configuration Register
 */
#define WCL_CORE_1_ENTRY_9_ADDR_REG (DR_REG_WCL_BASE + 0x420)
/** WCL_CORE_1_ENTRY_9_ADDR : R/W; bitpos: [31:0]; default: 0;
 *  Core_1 Entry 9 address from WORLD1 to WORLD0
 */
#define WCL_CORE_1_ENTRY_9_ADDR    0xFFFFFFFFU
#define WCL_CORE_1_ENTRY_9_ADDR_M  (WCL_CORE_1_ENTRY_9_ADDR_V << WCL_CORE_1_ENTRY_9_ADDR_S)
#define WCL_CORE_1_ENTRY_9_ADDR_V  0xFFFFFFFFU
#define WCL_CORE_1_ENTRY_9_ADDR_S  0

/** WCL_Core_1_ENTRY_10_ADDR_REG register
 *  Core_1 Entry 10 address configuration Register
 */
#define WCL_CORE_1_ENTRY_10_ADDR_REG (DR_REG_WCL_BASE + 0x424)
/** WCL_CORE_1_ENTRY_10_ADDR : R/W; bitpos: [31:0]; default: 0;
 *  Core_1 Entry 10 address from WORLD1 to WORLD0
 */
#define WCL_CORE_1_ENTRY_10_ADDR    0xFFFFFFFFU
#define WCL_CORE_1_ENTRY_10_ADDR_M  (WCL_CORE_1_ENTRY_10_ADDR_V << WCL_CORE_1_ENTRY_10_ADDR_S)
#define WCL_CORE_1_ENTRY_10_ADDR_V  0xFFFFFFFFU
#define WCL_CORE_1_ENTRY_10_ADDR_S  0

/** WCL_Core_1_ENTRY_11_ADDR_REG register
 *  Core_1 Entry 11 address configuration Register
 */
#define WCL_CORE_1_ENTRY_11_ADDR_REG (DR_REG_WCL_BASE + 0x428)
/** WCL_CORE_1_ENTRY_11_ADDR : R/W; bitpos: [31:0]; default: 0;
 *  Core_1 Entry 11 address from WORLD1 to WORLD0
 */
#define WCL_CORE_1_ENTRY_11_ADDR    0xFFFFFFFFU
#define WCL_CORE_1_ENTRY_11_ADDR_M  (WCL_CORE_1_ENTRY_11_ADDR_V << WCL_CORE_1_ENTRY_11_ADDR_S)
#define WCL_CORE_1_ENTRY_11_ADDR_V  0xFFFFFFFFU
#define WCL_CORE_1_ENTRY_11_ADDR_S  0

/** WCL_Core_1_ENTRY_12_ADDR_REG register
 *  Core_1 Entry 12 address configuration Register
 */
#define WCL_CORE_1_ENTRY_12_ADDR_REG (DR_REG_WCL_BASE + 0x42c)
/** WCL_CORE_1_ENTRY_12_ADDR : R/W; bitpos: [31:0]; default: 0;
 *  Core_1 Entry 12 address from WORLD1 to WORLD0
 */
#define WCL_CORE_1_ENTRY_12_ADDR    0xFFFFFFFFU
#define WCL_CORE_1_ENTRY_12_ADDR_M  (WCL_CORE_1_ENTRY_12_ADDR_V << WCL_CORE_1_ENTRY_12_ADDR_S)
#define WCL_CORE_1_ENTRY_12_ADDR_V  0xFFFFFFFFU
#define WCL_CORE_1_ENTRY_12_ADDR_S  0

/** WCL_Core_1_ENTRY_13_ADDR_REG register
 *  Core_1 Entry 13 address configuration Register
 */
#define WCL_CORE_1_ENTRY_13_ADDR_REG (DR_REG_WCL_BASE + 0x430)
/** WCL_CORE_1_ENTRY_13_ADDR : R/W; bitpos: [31:0]; default: 0;
 *  Core_1 Entry 13 address from WORLD1 to WORLD0
 */
#define WCL_CORE_1_ENTRY_13_ADDR    0xFFFFFFFFU
#define WCL_CORE_1_ENTRY_13_ADDR_M  (WCL_CORE_1_ENTRY_13_ADDR_V << WCL_CORE_1_ENTRY_13_ADDR_S)
#define WCL_CORE_1_ENTRY_13_ADDR_V  0xFFFFFFFFU
#define WCL_CORE_1_ENTRY_13_ADDR_S  0

/** WCL_Core_1_ENTRY_CHECK_REG register
 *  Core_1 Entry check configuration Register
 */
#define WCL_CORE_1_ENTRY_CHECK_REG (DR_REG_WCL_BASE + 0x47c)
/** WCL_CORE_1_ENTRY_CHECK : R/W; bitpos: [13:1]; default: 1;
 *  This filed is used to enable entry address check
 */
#define WCL_CORE_1_ENTRY_CHECK    0x00001FFFU
#define WCL_CORE_1_ENTRY_CHECK_M  (WCL_CORE_1_ENTRY_CHECK_V << WCL_CORE_1_ENTRY_CHECK_S)
#define WCL_CORE_1_ENTRY_CHECK_V  0x00001FFFU
#define WCL_CORE_1_ENTRY_CHECK_S  1

/** WCL_Core_1_STATUSTABLE1_REG register
 *  Status register of world switch of entry 1
 */
#define WCL_CORE_1_STATUSTABLE1_REG (DR_REG_WCL_BASE + 0x480)
/** WCL_CORE_1_FROM_WORLD_1 : R/W; bitpos: [0]; default: 0;
 *  This bit is used to confirm world before enter entry 1
 */
#define WCL_CORE_1_FROM_WORLD_1    (BIT(0))
#define WCL_CORE_1_FROM_WORLD_1_M  (WCL_CORE_1_FROM_WORLD_1_V << WCL_CORE_1_FROM_WORLD_1_S)
#define WCL_CORE_1_FROM_WORLD_1_V  0x00000001U
#define WCL_CORE_1_FROM_WORLD_1_S  0
/** WCL_CORE_1_FROM_ENTRY_1 : R/W; bitpos: [4:1]; default: 0;
 *  This filed is used to confirm in which entry before enter entry 1
 */
#define WCL_CORE_1_FROM_ENTRY_1    0x0000000FU
#define WCL_CORE_1_FROM_ENTRY_1_M  (WCL_CORE_1_FROM_ENTRY_1_V << WCL_CORE_1_FROM_ENTRY_1_S)
#define WCL_CORE_1_FROM_ENTRY_1_V  0x0000000FU
#define WCL_CORE_1_FROM_ENTRY_1_S  1
/** WCL_CORE_1_CURRENT_1 : R/W; bitpos: [5]; default: 0;
 *  This bit is used to confirm whether the current state is in entry 1
 */
#define WCL_CORE_1_CURRENT_1    (BIT(5))
#define WCL_CORE_1_CURRENT_1_M  (WCL_CORE_1_CURRENT_1_V << WCL_CORE_1_CURRENT_1_S)
#define WCL_CORE_1_CURRENT_1_V  0x00000001U
#define WCL_CORE_1_CURRENT_1_S  5

/** WCL_Core_1_STATUSTABLE2_REG register
 *  Status register of world switch of entry 2
 */
#define WCL_CORE_1_STATUSTABLE2_REG (DR_REG_WCL_BASE + 0x484)
/** WCL_CORE_1_FROM_WORLD_2 : R/W; bitpos: [0]; default: 0;
 *  This bit is used to confirm world before enter entry 2
 */
#define WCL_CORE_1_FROM_WORLD_2    (BIT(0))
#define WCL_CORE_1_FROM_WORLD_2_M  (WCL_CORE_1_FROM_WORLD_2_V << WCL_CORE_1_FROM_WORLD_2_S)
#define WCL_CORE_1_FROM_WORLD_2_V  0x00000001U
#define WCL_CORE_1_FROM_WORLD_2_S  0
/** WCL_CORE_1_FROM_ENTRY_2 : R/W; bitpos: [4:1]; default: 0;
 *  This filed is used to confirm in which entry before enter entry 2
 */
#define WCL_CORE_1_FROM_ENTRY_2    0x0000000FU
#define WCL_CORE_1_FROM_ENTRY_2_M  (WCL_CORE_1_FROM_ENTRY_2_V << WCL_CORE_1_FROM_ENTRY_2_S)
#define WCL_CORE_1_FROM_ENTRY_2_V  0x0000000FU
#define WCL_CORE_1_FROM_ENTRY_2_S  1
/** WCL_CORE_1_CURRENT_2 : R/W; bitpos: [5]; default: 0;
 *  This bit is used to confirm whether the current state is in entry 2
 */
#define WCL_CORE_1_CURRENT_2    (BIT(5))
#define WCL_CORE_1_CURRENT_2_M  (WCL_CORE_1_CURRENT_2_V << WCL_CORE_1_CURRENT_2_S)
#define WCL_CORE_1_CURRENT_2_V  0x00000001U
#define WCL_CORE_1_CURRENT_2_S  5

