espressif/esp-idf/components/soc/esp32s3/register/soc/world_controller_reg.h
/** WCL_Core_1_STATUSTABLE3_REG register
 *  Status register of world switch of entry 3
 */
#define WCL_CORE_1_STATUSTABLE3_REG (DR_REG_WCL_BASE + 0x488)
/** WCL_CORE_1_FROM_WORLD_3 : R/W; bitpos: [0]; default: 0;
 *  This bit is used to confirm world before enter entry 3
 */
#define WCL_CORE_1_FROM_WORLD_3    (BIT(0))
#define WCL_CORE_1_FROM_WORLD_3_M  (WCL_CORE_1_FROM_WORLD_3_V << WCL_CORE_1_FROM_WORLD_3_S)
#define WCL_CORE_1_FROM_WORLD_3_V  0x00000001U
#define WCL_CORE_1_FROM_WORLD_3_S  0
/** WCL_CORE_1_FROM_ENTRY_3 : R/W; bitpos: [4:1]; default: 0;
 *  This filed is used to confirm in which entry before enter entry 3
 */
#define WCL_CORE_1_FROM_ENTRY_3    0x0000000FU
#define WCL_CORE_1_FROM_ENTRY_3_M  (WCL_CORE_1_FROM_ENTRY_3_V << WCL_CORE_1_FROM_ENTRY_3_S)
#define WCL_CORE_1_FROM_ENTRY_3_V  0x0000000FU
#define WCL_CORE_1_FROM_ENTRY_3_S  1
/** WCL_CORE_1_CURRENT_3 : R/W; bitpos: [5]; default: 0;
 *  This bit is used to confirm whether the current state is in entry 3
 */
#define WCL_CORE_1_CURRENT_3    (BIT(5))
#define WCL_CORE_1_CURRENT_3_M  (WCL_CORE_1_CURRENT_3_V << WCL_CORE_1_CURRENT_3_S)
#define WCL_CORE_1_CURRENT_3_V  0x00000001U
#define WCL_CORE_1_CURRENT_3_S  5

/** WCL_Core_1_STATUSTABLE4_REG register
 *  Status register of world switch of entry 4
 */
#define WCL_CORE_1_STATUSTABLE4_REG (DR_REG_WCL_BASE + 0x48c)
/** WCL_CORE_1_FROM_WORLD_4 : R/W; bitpos: [0]; default: 0;
 *  This bit is used to confirm world before enter entry 4
 */
#define WCL_CORE_1_FROM_WORLD_4    (BIT(0))
#define WCL_CORE_1_FROM_WORLD_4_M  (WCL_CORE_1_FROM_WORLD_4_V << WCL_CORE_1_FROM_WORLD_4_S)
#define WCL_CORE_1_FROM_WORLD_4_V  0x00000001U
#define WCL_CORE_1_FROM_WORLD_4_S  0
/** WCL_CORE_1_FROM_ENTRY_4 : R/W; bitpos: [4:1]; default: 0;
 *  This filed is used to confirm in which entry before enter entry 4
 */
#define WCL_CORE_1_FROM_ENTRY_4    0x0000000FU
#define WCL_CORE_1_FROM_ENTRY_4_M  (WCL_CORE_1_FROM_ENTRY_4_V << WCL_CORE_1_FROM_ENTRY_4_S)
#define WCL_CORE_1_FROM_ENTRY_4_V  0x0000000FU
#define WCL_CORE_1_FROM_ENTRY_4_S  1
/** WCL_CORE_1_CURRENT_4 : R/W; bitpos: [5]; default: 0;
 *  This bit is used to confirm whether the current state is in entry 4
 */
#define WCL_CORE_1_CURRENT_4    (BIT(5))
#define WCL_CORE_1_CURRENT_4_M  (WCL_CORE_1_CURRENT_4_V << WCL_CORE_1_CURRENT_4_S)
#define WCL_CORE_1_CURRENT_4_V  0x00000001U
#define WCL_CORE_1_CURRENT_4_S  5

/** WCL_Core_1_STATUSTABLE5_REG register
 *  Status register of world switch of entry 5
 */
#define WCL_CORE_1_STATUSTABLE5_REG (DR_REG_WCL_BASE + 0x490)
/** WCL_CORE_1_FROM_WORLD_5 : R/W; bitpos: [0]; default: 0;
 *  This bit is used to confirm world before enter entry 5
 */
#define WCL_CORE_1_FROM_WORLD_5    (BIT(0))
#define WCL_CORE_1_FROM_WORLD_5_M  (WCL_CORE_1_FROM_WORLD_5_V << WCL_CORE_1_FROM_WORLD_5_S)
#define WCL_CORE_1_FROM_WORLD_5_V  0x00000001U
#define WCL_CORE_1_FROM_WORLD_5_S  0
/** WCL_CORE_1_FROM_ENTRY_5 : R/W; bitpos: [4:1]; default: 0;
 *  This filed is used to confirm in which entry before enter entry 5
 */
#define WCL_CORE_1_FROM_ENTRY_5    0x0000000FU
#define WCL_CORE_1_FROM_ENTRY_5_M  (WCL_CORE_1_FROM_ENTRY_5_V << WCL_CORE_1_FROM_ENTRY_5_S)
#define WCL_CORE_1_FROM_ENTRY_5_V  0x0000000FU
#define WCL_CORE_1_FROM_ENTRY_5_S  1
/** WCL_CORE_1_CURRENT_5 : R/W; bitpos: [5]; default: 0;
 *  This bit is used to confirm whether the current state is in entry 5
 */
#define WCL_CORE_1_CURRENT_5    (BIT(5))
#define WCL_CORE_1_CURRENT_5_M  (WCL_CORE_1_CURRENT_5_V << WCL_CORE_1_CURRENT_5_S)
#define WCL_CORE_1_CURRENT_5_V  0x00000001U
#define WCL_CORE_1_CURRENT_5_S  5

/** WCL_Core_1_STATUSTABLE6_REG register
 *  Status register of world switch of entry 6
 */
#define WCL_CORE_1_STATUSTABLE6_REG (DR_REG_WCL_BASE + 0x494)
/** WCL_CORE_1_FROM_WORLD_6 : R/W; bitpos: [0]; default: 0;
 *  This bit is used to confirm world before enter entry 6
 */
#define WCL_CORE_1_FROM_WORLD_6    (BIT(0))
#define WCL_CORE_1_FROM_WORLD_6_M  (WCL_CORE_1_FROM_WORLD_6_V << WCL_CORE_1_FROM_WORLD_6_S)
#define WCL_CORE_1_FROM_WORLD_6_V  0x00000001U
#define WCL_CORE_1_FROM_WORLD_6_S  0
/** WCL_CORE_1_FROM_ENTRY_6 : R/W; bitpos: [4:1]; default: 0;
 *  This filed is used to confirm in which entry before enter entry 6
 */
#define WCL_CORE_1_FROM_ENTRY_6    0x0000000FU
#define WCL_CORE_1_FROM_ENTRY_6_M  (WCL_CORE_1_FROM_ENTRY_6_V << WCL_CORE_1_FROM_ENTRY_6_S)
#define WCL_CORE_1_FROM_ENTRY_6_V  0x0000000FU
#define WCL_CORE_1_FROM_ENTRY_6_S  1
/** WCL_CORE_1_CURRENT_6 : R/W; bitpos: [5]; default: 0;
 *  This bit is used to confirm whether the current state is in entry 6
 */
#define WCL_CORE_1_CURRENT_6    (BIT(5))
#define WCL_CORE_1_CURRENT_6_M  (WCL_CORE_1_CURRENT_6_V << WCL_CORE_1_CURRENT_6_S)
#define WCL_CORE_1_CURRENT_6_V  0x00000001U
#define WCL_CORE_1_CURRENT_6_S  5

/** WCL_Core_1_STATUSTABLE7_REG register
 *  Status register of world switch of entry 7
 */
#define WCL_CORE_1_STATUSTABLE7_REG (DR_REG_WCL_BASE + 0x498)
/** WCL_CORE_1_FROM_WORLD_7 : R/W; bitpos: [0]; default: 0;
 *  This bit is used to confirm world before enter entry 7
 */
#define WCL_CORE_1_FROM_WORLD_7    (BIT(0))
#define WCL_CORE_1_FROM_WORLD_7_M  (WCL_CORE_1_FROM_WORLD_7_V << WCL_CORE_1_FROM_WORLD_7_S)
#define WCL_CORE_1_FROM_WORLD_7_V  0x00000001U
#define WCL_CORE_1_FROM_WORLD_7_S  0
/** WCL_CORE_1_FROM_ENTRY_7 : R/W; bitpos: [4:1]; default: 0;
 *  This filed is used to confirm in which entry before enter entry 7
 */
#define WCL_CORE_1_FROM_ENTRY_7    0x0000000FU
#define WCL_CORE_1_FROM_ENTRY_7_M  (WCL_CORE_1_FROM_ENTRY_7_V << WCL_CORE_1_FROM_ENTRY_7_S)
#define WCL_CORE_1_FROM_ENTRY_7_V  0x0000000FU
#define WCL_CORE_1_FROM_ENTRY_7_S  1
/** WCL_CORE_1_CURRENT_7 : R/W; bitpos: [5]; default: 0;
 *  This bit is used to confirm whether the current state is in entry 7
 */
#define WCL_CORE_1_CURRENT_7    (BIT(5))
#define WCL_CORE_1_CURRENT_7_M  (WCL_CORE_1_CURRENT_7_V << WCL_CORE_1_CURRENT_7_S)
#define WCL_CORE_1_CURRENT_7_V  0x00000001U
#define WCL_CORE_1_CURRENT_7_S  5

/** WCL_Core_1_STATUSTABLE8_REG register
 *  Status register of world switch of entry 8
 */
#define WCL_CORE_1_STATUSTABLE8_REG (DR_REG_WCL_BASE + 0x49c)
/** WCL_CORE_1_FROM_WORLD_8 : R/W; bitpos: [0]; default: 0;
 *  This bit is used to confirm world before enter entry 8
 */
#define WCL_CORE_1_FROM_WORLD_8    (BIT(0))
#define WCL_CORE_1_FROM_WORLD_8_M  (WCL_CORE_1_FROM_WORLD_8_V << WCL_CORE_1_FROM_WORLD_8_S)
#define WCL_CORE_1_FROM_WORLD_8_V  0x00000001U
#define WCL_CORE_1_FROM_WORLD_8_S  0
/** WCL_CORE_1_FROM_ENTRY_8 : R/W; bitpos: [4:1]; default: 0;
 *  This filed is used to confirm in which entry before enter entry 8
 */
#define WCL_CORE_1_FROM_ENTRY_8    0x0000000FU
#define WCL_CORE_1_FROM_ENTRY_8_M  (WCL_CORE_1_FROM_ENTRY_8_V << WCL_CORE_1_FROM_ENTRY_8_S)
#define WCL_CORE_1_FROM_ENTRY_8_V  0x0000000FU
#define WCL_CORE_1_FROM_ENTRY_8_S  1
/** WCL_CORE_1_CURRENT_8 : R/W; bitpos: [5]; default: 0;
 *  This bit is used to confirm whether the current state is in entry 8
 */
#define WCL_CORE_1_CURRENT_8    (BIT(5))
#define WCL_CORE_1_CURRENT_8_M  (WCL_CORE_1_CURRENT_8_V << WCL_CORE_1_CURRENT_8_S)
#define WCL_CORE_1_CURRENT_8_V  0x00000001U
#define WCL_CORE_1_CURRENT_8_S  5

/** WCL_Core_1_STATUSTABLE9_REG register
 *  Status register of world switch of entry 9
 */
#define WCL_CORE_1_STATUSTABLE9_REG (DR_REG_WCL_BASE + 0x4a0)
/** WCL_CORE_1_FROM_WORLD_9 : R/W; bitpos: [0]; default: 0;
 *  This bit is used to confirm world before enter entry 9
 */
#define WCL_CORE_1_FROM_WORLD_9    (BIT(0))
#define WCL_CORE_1_FROM_WORLD_9_M  (WCL_CORE_1_FROM_WORLD_9_V << WCL_CORE_1_FROM_WORLD_9_S)
#define WCL_CORE_1_FROM_WORLD_9_V  0x00000001U
#define WCL_CORE_1_FROM_WORLD_9_S  0
/** WCL_CORE_1_FROM_ENTRY_9 : R/W; bitpos: [4:1]; default: 0;
 *  This filed is used to confirm in which entry before enter entry 9
 */
#define WCL_CORE_1_FROM_ENTRY_9    0x0000000FU
#define WCL_CORE_1_FROM_ENTRY_9_M  (WCL_CORE_1_FROM_ENTRY_9_V << WCL_CORE_1_FROM_ENTRY_9_S)
#define WCL_CORE_1_FROM_ENTRY_9_V  0x0000000FU
#define WCL_CORE_1_FROM_ENTRY_9_S  1
/** WCL_CORE_1_CURRENT_9 : R/W; bitpos: [5]; default: 0;
 *  This bit is used to confirm whether the current state is in entry 9
 */
#define WCL_CORE_1_CURRENT_9    (BIT(5))
#define WCL_CORE_1_CURRENT_9_M  (WCL_CORE_1_CURRENT_9_V << WCL_CORE_1_CURRENT_9_S)
#define WCL_CORE_1_CURRENT_9_V  0x00000001U
#define WCL_CORE_1_CURRENT_9_S  5

/** WCL_Core_1_STATUSTABLE10_REG register
 *  Status register of world switch of entry 10
 */
#define WCL_CORE_1_STATUSTABLE10_REG (DR_REG_WCL_BASE + 0x4a4)
/** WCL_CORE_1_FROM_WORLD_10 : R/W; bitpos: [0]; default: 0;
 *  This bit is used to confirm world before enter entry 10
 */
#define WCL_CORE_1_FROM_WORLD_10    (BIT(0))
#define WCL_CORE_1_FROM_WORLD_10_M  (WCL_CORE_1_FROM_WORLD_10_V << WCL_CORE_1_FROM_WORLD_10_S)
#define WCL_CORE_1_FROM_WORLD_10_V  0x00000001U
#define WCL_CORE_1_FROM_WORLD_10_S  0
/** WCL_CORE_1_FROM_ENTRY_10 : R/W; bitpos: [4:1]; default: 0;
 *  This filed is used to confirm in which entry before enter entry 10
 */
#define WCL_CORE_1_FROM_ENTRY_10    0x0000000FU
#define WCL_CORE_1_FROM_ENTRY_10_M  (WCL_CORE_1_FROM_ENTRY_10_V << WCL_CORE_1_FROM_ENTRY_10_S)
#define WCL_CORE_1_FROM_ENTRY_10_V  0x0000000FU
#define WCL_CORE_1_FROM_ENTRY_10_S  1
/** WCL_CORE_1_CURRENT_10 : R/W; bitpos: [5]; default: 0;
 *  This bit is used to confirm whether the current state is in entry 10
 */
#define WCL_CORE_1_CURRENT_10    (BIT(5))
#define WCL_CORE_1_CURRENT_10_M  (WCL_CORE_1_CURRENT_10_V << WCL_CORE_1_CURRENT_10_S)
#define WCL_CORE_1_CURRENT_10_V  0x00000001U
#define WCL_CORE_1_CURRENT_10_S  5

