espressif/esp-idf/components/soc/esp32s3/register/soc/world_controller_reg.h
/** WCL_Core_1_STATUSTABLE11_REG register
 *  Status register of world switch of entry 11
 */
#define WCL_CORE_1_STATUSTABLE11_REG (DR_REG_WCL_BASE + 0x4a8)
/** WCL_CORE_1_FROM_WORLD_11 : R/W; bitpos: [0]; default: 0;
 *  This bit is used to confirm world before enter entry 11
 */
#define WCL_CORE_1_FROM_WORLD_11    (BIT(0))
#define WCL_CORE_1_FROM_WORLD_11_M  (WCL_CORE_1_FROM_WORLD_11_V << WCL_CORE_1_FROM_WORLD_11_S)
#define WCL_CORE_1_FROM_WORLD_11_V  0x00000001U
#define WCL_CORE_1_FROM_WORLD_11_S  0
/** WCL_CORE_1_FROM_ENTRY_11 : R/W; bitpos: [4:1]; default: 0;
 *  This filed is used to confirm in which entry before enter entry 11
 */
#define WCL_CORE_1_FROM_ENTRY_11    0x0000000FU
#define WCL_CORE_1_FROM_ENTRY_11_M  (WCL_CORE_1_FROM_ENTRY_11_V << WCL_CORE_1_FROM_ENTRY_11_S)
#define WCL_CORE_1_FROM_ENTRY_11_V  0x0000000FU
#define WCL_CORE_1_FROM_ENTRY_11_S  1
/** WCL_CORE_1_CURRENT_11 : R/W; bitpos: [5]; default: 0;
 *  This bit is used to confirm whether the current state is in entry 11
 */
#define WCL_CORE_1_CURRENT_11    (BIT(5))
#define WCL_CORE_1_CURRENT_11_M  (WCL_CORE_1_CURRENT_11_V << WCL_CORE_1_CURRENT_11_S)
#define WCL_CORE_1_CURRENT_11_V  0x00000001U
#define WCL_CORE_1_CURRENT_11_S  5

/** WCL_Core_1_STATUSTABLE12_REG register
 *  Status register of world switch of entry 12
 */
#define WCL_CORE_1_STATUSTABLE12_REG (DR_REG_WCL_BASE + 0x4ac)
/** WCL_CORE_1_FROM_WORLD_12 : R/W; bitpos: [0]; default: 0;
 *  This bit is used to confirm world before enter entry 12
 */
#define WCL_CORE_1_FROM_WORLD_12    (BIT(0))
#define WCL_CORE_1_FROM_WORLD_12_M  (WCL_CORE_1_FROM_WORLD_12_V << WCL_CORE_1_FROM_WORLD_12_S)
#define WCL_CORE_1_FROM_WORLD_12_V  0x00000001U
#define WCL_CORE_1_FROM_WORLD_12_S  0
/** WCL_CORE_1_FROM_ENTRY_12 : R/W; bitpos: [4:1]; default: 0;
 *  This filed is used to confirm in which entry before enter entry 12
 */
#define WCL_CORE_1_FROM_ENTRY_12    0x0000000FU
#define WCL_CORE_1_FROM_ENTRY_12_M  (WCL_CORE_1_FROM_ENTRY_12_V << WCL_CORE_1_FROM_ENTRY_12_S)
#define WCL_CORE_1_FROM_ENTRY_12_V  0x0000000FU
#define WCL_CORE_1_FROM_ENTRY_12_S  1
/** WCL_CORE_1_CURRENT_12 : R/W; bitpos: [5]; default: 0;
 *  This bit is used to confirm whether the current state is in entry 12
 */
#define WCL_CORE_1_CURRENT_12    (BIT(5))
#define WCL_CORE_1_CURRENT_12_M  (WCL_CORE_1_CURRENT_12_V << WCL_CORE_1_CURRENT_12_S)
#define WCL_CORE_1_CURRENT_12_V  0x00000001U
#define WCL_CORE_1_CURRENT_12_S  5

/** WCL_Core_1_STATUSTABLE13_REG register
 *  Status register of world switch of entry 13
 */
#define WCL_CORE_1_STATUSTABLE13_REG (DR_REG_WCL_BASE + 0x4b0)
/** WCL_CORE_1_FROM_WORLD_13 : R/W; bitpos: [0]; default: 0;
 *  This bit is used to confirm world before enter entry 13
 */
#define WCL_CORE_1_FROM_WORLD_13    (BIT(0))
#define WCL_CORE_1_FROM_WORLD_13_M  (WCL_CORE_1_FROM_WORLD_13_V << WCL_CORE_1_FROM_WORLD_13_S)
#define WCL_CORE_1_FROM_WORLD_13_V  0x00000001U
#define WCL_CORE_1_FROM_WORLD_13_S  0
/** WCL_CORE_1_FROM_ENTRY_13 : R/W; bitpos: [4:1]; default: 0;
 *  This filed is used to confirm in which entry before enter entry 13
 */
#define WCL_CORE_1_FROM_ENTRY_13    0x0000000FU
#define WCL_CORE_1_FROM_ENTRY_13_M  (WCL_CORE_1_FROM_ENTRY_13_V << WCL_CORE_1_FROM_ENTRY_13_S)
#define WCL_CORE_1_FROM_ENTRY_13_V  0x0000000FU
#define WCL_CORE_1_FROM_ENTRY_13_S  1
/** WCL_CORE_1_CURRENT_13 : R/W; bitpos: [5]; default: 0;
 *  This bit is used to confirm whether the current state is in entry 13
 */
#define WCL_CORE_1_CURRENT_13    (BIT(5))
#define WCL_CORE_1_CURRENT_13_M  (WCL_CORE_1_CURRENT_13_V << WCL_CORE_1_CURRENT_13_S)
#define WCL_CORE_1_CURRENT_13_V  0x00000001U
#define WCL_CORE_1_CURRENT_13_S  5

/** WCL_Core_1_STATUSTABLE_CURRENT_REG register
 *  Status register of statustable current
 */
#define WCL_CORE_1_STATUSTABLE_CURRENT_REG (DR_REG_WCL_BASE + 0x4fc)
/** WCL_CORE_1_STATUSTABLE_CURRENT : R/W; bitpos: [13:1]; default: 0;
 *  This field is used to quickly read and rewrite the current field of all STATUSTABLE
 *  registers,for example,bit 1 represents the current field of STATUSTABLE1
 */
#define WCL_CORE_1_STATUSTABLE_CURRENT    0x00001FFFU
#define WCL_CORE_1_STATUSTABLE_CURRENT_M  (WCL_CORE_1_STATUSTABLE_CURRENT_V << WCL_CORE_1_STATUSTABLE_CURRENT_S)
#define WCL_CORE_1_STATUSTABLE_CURRENT_V  0x00001FFFU
#define WCL_CORE_1_STATUSTABLE_CURRENT_S  1

/** WCL_Core_1_MESSAGE_ADDR_REG register
 *  Clear writer_buffer write address configuration register
 */
#define WCL_CORE_1_MESSAGE_ADDR_REG (DR_REG_WCL_BASE + 0x500)
/** WCL_CORE_1_MESSAGE_ADDR : R/W; bitpos: [31:0]; default: 0;
 *  This field is used to set address that need to write when enter WORLD0
 */
#define WCL_CORE_1_MESSAGE_ADDR    0xFFFFFFFFU
#define WCL_CORE_1_MESSAGE_ADDR_M  (WCL_CORE_1_MESSAGE_ADDR_V << WCL_CORE_1_MESSAGE_ADDR_S)
#define WCL_CORE_1_MESSAGE_ADDR_V  0xFFFFFFFFU
#define WCL_CORE_1_MESSAGE_ADDR_S  0

/** WCL_Core_1_MESSAGE_MAX_REG register
 *  Clear writer_buffer write number configuration register
 */
#define WCL_CORE_1_MESSAGE_MAX_REG (DR_REG_WCL_BASE + 0x504)
/** WCL_CORE_1_MESSAGE_MAX : R/W; bitpos: [3:0]; default: 0;
 *  This filed is used to set the max value of clear write_buffer
 */
#define WCL_CORE_1_MESSAGE_MAX    0x0000000FU
#define WCL_CORE_1_MESSAGE_MAX_M  (WCL_CORE_1_MESSAGE_MAX_V << WCL_CORE_1_MESSAGE_MAX_S)
#define WCL_CORE_1_MESSAGE_MAX_V  0x0000000FU
#define WCL_CORE_1_MESSAGE_MAX_S  0

/** WCL_Core_1_MESSAGE_PHASE_REG register
 *  Clear writer_buffer status register
 */
#define WCL_CORE_1_MESSAGE_PHASE_REG (DR_REG_WCL_BASE + 0x508)
/** WCL_CORE_1_MESSAGE_MATCH : RO; bitpos: [0]; default: 0;
 *  This bit indicates whether the check is successful
 */
#define WCL_CORE_1_MESSAGE_MATCH    (BIT(0))
#define WCL_CORE_1_MESSAGE_MATCH_M  (WCL_CORE_1_MESSAGE_MATCH_V << WCL_CORE_1_MESSAGE_MATCH_S)
#define WCL_CORE_1_MESSAGE_MATCH_V  0x00000001U
#define WCL_CORE_1_MESSAGE_MATCH_S  0
/** WCL_CORE_1_MESSAGE_EXPECT : RO; bitpos: [4:1]; default: 0;
 *  This field indicates the data to be written next time
 */
#define WCL_CORE_1_MESSAGE_EXPECT    0x0000000FU
#define WCL_CORE_1_MESSAGE_EXPECT_M  (WCL_CORE_1_MESSAGE_EXPECT_V << WCL_CORE_1_MESSAGE_EXPECT_S)
#define WCL_CORE_1_MESSAGE_EXPECT_V  0x0000000FU
#define WCL_CORE_1_MESSAGE_EXPECT_S  1
/** WCL_CORE_1_MESSAGE_DATAPHASE : RO; bitpos: [5]; default: 0;
 *  If this bit is 1, it means that is checking clear write_buffer operation, and is
 *  checking data
 */
#define WCL_CORE_1_MESSAGE_DATAPHASE    (BIT(5))
#define WCL_CORE_1_MESSAGE_DATAPHASE_M  (WCL_CORE_1_MESSAGE_DATAPHASE_V << WCL_CORE_1_MESSAGE_DATAPHASE_S)
#define WCL_CORE_1_MESSAGE_DATAPHASE_V  0x00000001U
#define WCL_CORE_1_MESSAGE_DATAPHASE_S  5
/** WCL_CORE_1_MESSAGE_ADDRESSPHASE : RO; bitpos: [6]; default: 0;
 *  If this bit is 1, it means that is checking clear write_buffer operation, and is
 *  checking address.
 */
#define WCL_CORE_1_MESSAGE_ADDRESSPHASE    (BIT(6))
#define WCL_CORE_1_MESSAGE_ADDRESSPHASE_M  (WCL_CORE_1_MESSAGE_ADDRESSPHASE_V << WCL_CORE_1_MESSAGE_ADDRESSPHASE_S)
#define WCL_CORE_1_MESSAGE_ADDRESSPHASE_V  0x00000001U
#define WCL_CORE_1_MESSAGE_ADDRESSPHASE_S  6

/** WCL_Core_1_World_TRIGGER_ADDR_REG register
 *  Core_1 trigger address configuration Register
 */
#define WCL_CORE_1_WORLD_TRIGGER_ADDR_REG (DR_REG_WCL_BASE + 0x540)
/** WCL_CORE_1_WORLD_TRIGGER_ADDR : RW; bitpos: [31:0]; default: 0;
 *  This field is used to configure the entry address from WORLD0 to WORLD1,when the
 *  CPU executes to this address,switch to WORLD1
 */
#define WCL_CORE_1_WORLD_TRIGGER_ADDR    0xFFFFFFFFU
#define WCL_CORE_1_WORLD_TRIGGER_ADDR_M  (WCL_CORE_1_WORLD_TRIGGER_ADDR_V << WCL_CORE_1_WORLD_TRIGGER_ADDR_S)
#define WCL_CORE_1_WORLD_TRIGGER_ADDR_V  0xFFFFFFFFU
#define WCL_CORE_1_WORLD_TRIGGER_ADDR_S  0

/** WCL_Core_1_World_PREPARE_REG register
 *  Core_1 prepare world configuration Register
 */
#define WCL_CORE_1_WORLD_PREPARE_REG (DR_REG_WCL_BASE + 0x544)
/** WCL_CORE_1_WORLD_PREPARE : R/W; bitpos: [1:0]; default: 0;
 *  This field to used to set world to enter,2'b01 means WORLD0, 2'b10 means WORLD1
 */
#define WCL_CORE_1_WORLD_PREPARE    0x00000003U
#define WCL_CORE_1_WORLD_PREPARE_M  (WCL_CORE_1_WORLD_PREPARE_V << WCL_CORE_1_WORLD_PREPARE_S)
#define WCL_CORE_1_WORLD_PREPARE_V  0x00000003U
#define WCL_CORE_1_WORLD_PREPARE_S  0

