espressif/esp-idf/components/soc/esp32s3/register/soc/world_controller_reg.h
/** WCL_Core_1_World_UPDATE_REG register
 *  Core_1 configuration update register
 */
#define WCL_CORE_1_WORLD_UPDATE_REG (DR_REG_WCL_BASE + 0x548)
/** WCL_CORE_1_UPDATE : WO; bitpos: [31:0]; default: 0;
 *  This field is used to update configuration completed, can write any value,the
 *  hardware only checks the write operation of this register and does not case about
 *  its value
 */
#define WCL_CORE_1_UPDATE    0xFFFFFFFFU
#define WCL_CORE_1_UPDATE_M  (WCL_CORE_1_UPDATE_V << WCL_CORE_1_UPDATE_S)
#define WCL_CORE_1_UPDATE_V  0xFFFFFFFFU
#define WCL_CORE_1_UPDATE_S  0

/** WCL_Core_1_World_Cancel_REG register
 *  Core_1 configuration cancel register
 */
#define WCL_CORE_1_WORLD_CANCEL_REG (DR_REG_WCL_BASE + 0x54c)
/** WCL_CORE_1_WORLD_CANCEL : WO; bitpos: [31:0]; default: 0;
 *  This field is used to cancel switch world configuration,if the trigger address and
 *  update configuration complete,can use this register to cancel world switch. can
 *  write any value, the hardware only checks the write operation of this register and
 *  does not case about its value
 */
#define WCL_CORE_1_WORLD_CANCEL    0xFFFFFFFFU
#define WCL_CORE_1_WORLD_CANCEL_M  (WCL_CORE_1_WORLD_CANCEL_V << WCL_CORE_1_WORLD_CANCEL_S)
#define WCL_CORE_1_WORLD_CANCEL_V  0xFFFFFFFFU
#define WCL_CORE_1_WORLD_CANCEL_S  0

/** WCL_Core_1_World_IRam0_REG register
 *  Core_1 Iram0 world register
 */
#define WCL_CORE_1_WORLD_IRAM0_REG (DR_REG_WCL_BASE + 0x550)
/** WCL_CORE_1_WORLD_IRAM0 : R/W; bitpos: [1:0]; default: 0;
 *  this field is used to read current world of Iram0 bus
 */
#define WCL_CORE_1_WORLD_IRAM0    0x00000003U
#define WCL_CORE_1_WORLD_IRAM0_M  (WCL_CORE_1_WORLD_IRAM0_V << WCL_CORE_1_WORLD_IRAM0_S)
#define WCL_CORE_1_WORLD_IRAM0_V  0x00000003U
#define WCL_CORE_1_WORLD_IRAM0_S  0

/** WCL_Core_1_World_DRam0_PIF_REG register
 *  Core_1 dram0 and PIF world register
 */
#define WCL_CORE_1_WORLD_DRAM0_PIF_REG (DR_REG_WCL_BASE + 0x554)
/** WCL_CORE_1_WORLD_DRAM0_PIF : R/W; bitpos: [1:0]; default: 0;
 *  this field is used to read current world of Dram0 bus and PIF bus
 */
#define WCL_CORE_1_WORLD_DRAM0_PIF    0x00000003U
#define WCL_CORE_1_WORLD_DRAM0_PIF_M  (WCL_CORE_1_WORLD_DRAM0_PIF_V << WCL_CORE_1_WORLD_DRAM0_PIF_S)
#define WCL_CORE_1_WORLD_DRAM0_PIF_V  0x00000003U
#define WCL_CORE_1_WORLD_DRAM0_PIF_S  0

/** WCL_Core_1_World_Phase_REG register
 *  Core_0 world status register
 */
#define WCL_CORE_1_WORLD_PHASE_REG (DR_REG_WCL_BASE + 0x558)
/** WCL_CORE_1_WORLD_PHASE : RO; bitpos: [0]; default: 0;
 *  This bit indicates whether is preparing to switch to WORLD1,1 means value.
 */
#define WCL_CORE_1_WORLD_PHASE    (BIT(0))
#define WCL_CORE_1_WORLD_PHASE_M  (WCL_CORE_1_WORLD_PHASE_V << WCL_CORE_1_WORLD_PHASE_S)
#define WCL_CORE_1_WORLD_PHASE_V  0x00000001U
#define WCL_CORE_1_WORLD_PHASE_S  0

/** WCL_Core_1_NMI_MASK_ENABLE_REG register
 *  Core_1 NMI mask enable register
 */
#define WCL_CORE_1_NMI_MASK_ENABLE_REG (DR_REG_WCL_BASE + 0x580)
/** WCL_CORE_1_NMI_MASK_ENABLE : WO; bitpos: [31:0]; default: 0;
 *  this field is used to set NMI mask, it can write any value, when write this
 *  register,the hardware start masking NMI interrupt
 */
#define WCL_CORE_1_NMI_MASK_ENABLE    0xFFFFFFFFU
#define WCL_CORE_1_NMI_MASK_ENABLE_M  (WCL_CORE_1_NMI_MASK_ENABLE_V << WCL_CORE_1_NMI_MASK_ENABLE_S)
#define WCL_CORE_1_NMI_MASK_ENABLE_V  0xFFFFFFFFU
#define WCL_CORE_1_NMI_MASK_ENABLE_S  0

/** WCL_Core_1_NMI_MASK_TRIGGER_ADDR_REG register
 *  Core_1 NMI mask trigger addr register
 */
#define WCL_CORE_1_NMI_MASK_TRIGGER_ADDR_REG (DR_REG_WCL_BASE + 0x584)
/** WCL_CORE_1_NMI_MASK_TRIGGER_ADDR : R/W; bitpos: [31:0]; default: 0;
 *  this field to used to set trigger address
 */
#define WCL_CORE_1_NMI_MASK_TRIGGER_ADDR    0xFFFFFFFFU
#define WCL_CORE_1_NMI_MASK_TRIGGER_ADDR_M  (WCL_CORE_1_NMI_MASK_TRIGGER_ADDR_V << WCL_CORE_1_NMI_MASK_TRIGGER_ADDR_S)
#define WCL_CORE_1_NMI_MASK_TRIGGER_ADDR_V  0xFFFFFFFFU
#define WCL_CORE_1_NMI_MASK_TRIGGER_ADDR_S  0

/** WCL_Core_1_NMI_MASK_DISABLE_REG register
 *  Core_1 NMI mask disable register
 */
#define WCL_CORE_1_NMI_MASK_DISABLE_REG (DR_REG_WCL_BASE + 0x588)
/** WCL_CORE_1_NMI_MASK_DISABLE : WO; bitpos: [31:0]; default: 0;
 *  this field is used to disable NMI mask, it will not take effect immediately,only
 *  when the CPU executes to the trigger address will it start to cancel NMI mask
 */
#define WCL_CORE_1_NMI_MASK_DISABLE    0xFFFFFFFFU
#define WCL_CORE_1_NMI_MASK_DISABLE_M  (WCL_CORE_1_NMI_MASK_DISABLE_V << WCL_CORE_1_NMI_MASK_DISABLE_S)
#define WCL_CORE_1_NMI_MASK_DISABLE_V  0xFFFFFFFFU
#define WCL_CORE_1_NMI_MASK_DISABLE_S  0

/** WCL_Core_1_NMI_MASK_CANCLE_REG register
 *  Core_1 NMI mask disable register
 */
#define WCL_CORE_1_NMI_MASK_CANCLE_REG (DR_REG_WCL_BASE + 0x58c)
/** WCL_CORE_1_NMI_MASK_CANCEL : WO; bitpos: [31:0]; default: 0;
 *  this field is used to cancel NMI mask disable function.
 */
#define WCL_CORE_1_NMI_MASK_CANCEL    0xFFFFFFFFU
#define WCL_CORE_1_NMI_MASK_CANCEL_M  (WCL_CORE_1_NMI_MASK_CANCEL_V << WCL_CORE_1_NMI_MASK_CANCEL_S)
#define WCL_CORE_1_NMI_MASK_CANCEL_V  0xFFFFFFFFU
#define WCL_CORE_1_NMI_MASK_CANCEL_S  0

/** WCL_Core_1_NMI_MASK_REG register
 *  Core_1 NMI mask register
 */
#define WCL_CORE_1_NMI_MASK_REG (DR_REG_WCL_BASE + 0x590)
/** WCL_CORE_1_NMI_MASK : R/W; bitpos: [0]; default: 0;
 *  this bit is used to mask NMI interrupt,it can directly mask NMI interrupt
 */
#define WCL_CORE_1_NMI_MASK    (BIT(0))
#define WCL_CORE_1_NMI_MASK_M  (WCL_CORE_1_NMI_MASK_V << WCL_CORE_1_NMI_MASK_S)
#define WCL_CORE_1_NMI_MASK_V  0x00000001U
#define WCL_CORE_1_NMI_MASK_S  0

/** WCL_Core_1_NMI_MASK_PHASE_REG register
 *  Core_1 NMI mask phase register
 */
#define WCL_CORE_1_NMI_MASK_PHASE_REG (DR_REG_WCL_BASE + 0x594)
/** WCL_CORE_1_NMI_MASK_PHASE : RO; bitpos: [0]; default: 0;
 *  this bit is used to indicates whether the NMI interrupt is being masked, 1 means
 *  NMI interrupt is being masked
 */
#define WCL_CORE_1_NMI_MASK_PHASE    (BIT(0))
#define WCL_CORE_1_NMI_MASK_PHASE_M  (WCL_CORE_1_NMI_MASK_PHASE_V << WCL_CORE_1_NMI_MASK_PHASE_S)
#define WCL_CORE_1_NMI_MASK_PHASE_V  0x00000001U
#define WCL_CORE_1_NMI_MASK_PHASE_S  0

#ifdef __cplusplus
}
#endif
